# POSTTEST 4
### Nama: Narupa Rangga Goroguta
### NIM : 2209106004
### Kelas: A1 22 Kecerdasan Buatan

In [1]:
from sklearn.impute import SimpleImputer
import numpy as np
import pandas as pd

## data sebelum manipulasi
### tidak ada null namun memiliki 12 data yang terduplikat

In [2]:
df = pd.read_csv('income.csv')
df.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,40,Self-emp-not-inc,223881,Prof-school,15.0,Married-civ-spouse,Prof-specialty,Husband,White,Male,99999,0,70,United-States,>50K
1,30,Private,149118,HS-grad,9.0,Divorced,Craft-repair,Not-in-family,White,Female,0,0,40,United-States,<=50K
2,46,Private,109209,Some-college,NaN,Married-civ-spouse,Adm-clerical,Husband,White,Male,0,0,40,United-States,>50K
3,32,Private,229566,Assoc-voc,11.0,Married-civ-spouse,Other-service,Husband,White,Male,0,0,60,United-States,>50K
4,54,?,148657,Preschool,1.0,Married-civ-spouse,?,Wife,White,Female,0,0,40,Mexico,<=50K

### namun disini sudah saya jadikan null beberapa data

In [3]:
df.isna().sum()

age               0
workclass         0
fnlwgt            0
education         0
education.num     5
marital.status    0
occupation        0
relationship      0
race              0
sex               0
capital.gain      0
capital.loss      0
hours.per.week    0
native.country    0
income            0
dtype: int64

In [4]:
df.duplicated().sum()

12

# Data Manipulasi

In [5]:
df

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,40,Self-emp-not-inc,223881,Prof-school,15.0,Married-civ-spouse,Prof-specialty,Husband,White,Male,99999,0,70,United-States,>50K
1,30,Private,149118,HS-grad,9.0,Divorced,Craft-repair,Not-in-family,White,Female,0,0,40,United-States,<=50K
2,46,Private,109209,Some-college,NaN,Married-civ-spouse,Adm-clerical,Husband,White,Male,0,0,40,United-States,>50K
3,32,Private,229566,Assoc-voc,11.0,Married-civ-spouse,Other-service,Husband,White,Male,0,0,60,United-States,>50K
4,54,?,148657,Preschool,1.0,Married-civ-spouse,?,Wife,White,Female,0,0,40,Mexico,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
24995,40,Private,130834,Some-college,10.0,Never-married,Adm-clerical,Not-in-family,White,Female,0,0,40,United-States,<=50K
24996,31,Local-gov,33124,Bachelors,13.0,Never-married,Prof-specialty,Not-in-family,White,Female,0,0,50,United-States,<=50K
24997,38,Federal-gov,190895,Bachelors,13.0,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,40,?,>50K
24998,23,Private,420973,Bachelors,13.0,Never-married,Prof-specialty,Not-in-family,White,Female,0,0,40,United-States,<=50K
24999,60,Private,88055,10th,6.0,Married-civ-spouse,Transport-moving,Husband,White,Male,0,0,40,United-States,<=50K

## Data Cleaning
### data null terdapat pada kolom education_num sebanyak 5

In [6]:
df.isna().sum()

age               0
workclass         0
fnlwgt            0
education         0
education.num     5
marital.status    0
occupation        0
relationship      0
race              0
sex               0
capital.gain      0
capital.loss      0
hours.per.week    0
native.country    0
income            0
dtype: int64

In [7]:
si_mean = SimpleImputer(strategy='mean')
si_mean.fit(df[['education.num']])
df[['education.num']] = si_mean.transform(df[['education.num']])

### mengganti nilai null yang ada pada kolom education.sum

In [8]:
df.isna().sum()

age               0
workclass         0
fnlwgt            0
education         0
education.num     0
marital.status    0
occupation        0
relationship      0
race              0
sex               0
capital.gain      0
capital.loss      0
hours.per.week    0
native.country    0
income            0
dtype: int64

###### Menghapus data duplikat

In [9]:
df.drop_duplicates(inplace=True)

##### mengecek kembali apakah masih ada data duplikasi atau tidak

In [10]:
df.duplicated().sum()

0

## Menganti tipe data

In [11]:
df.dtypes

age                 int64
workclass          object
fnlwgt              int64
education          object
education.num     float64
marital.status     object
occupation         object
relationship       object
race               object
sex                object
capital.gain        int64
capital.loss        int64
hours.per.week      int64
native.country     object
income             object
dtype: object

#### saya Mengubah tide data kolom "capital.loss" dari int64 ke float

In [12]:
df['capital.loss'] = df['capital.loss'].astype('float')

#### data setelah diubah tipenya

In [13]:
df.dtypes

age                 int64
workclass          object
fnlwgt              int64
education          object
education.num     float64
marital.status     object
occupation         object
relationship       object
race               object
sex                object
capital.gain        int64
capital.loss      float64
hours.per.week      int64
native.country     object
income             object
dtype: object

## data Transformation

In [14]:
df.dtypes

age                 int64
workclass          object
fnlwgt              int64
education          object
education.num     float64
marital.status     object
occupation         object
relationship       object
race               object
sex                object
capital.gain        int64
capital.loss      float64
hours.per.week      int64
native.country     object
income             object
dtype: object

#### saya menggunakan semua data numerik yang ada di data

In [15]:
from sklearn.preprocessing import StandardScaler

### standarisai

In [16]:
ss = StandardScaler()
df2 = df.copy()
df2[['age','fnlwgt' ,'education.num', 'capital.gain', 'capital.loss', 'hours.per.week' ]] = ss.fit_transform(df2[['age','fnlwgt' ,'education.num', 'capital.gain', 'capital.loss', 'hours.per.week' ]])

In [17]:
df2[['age','fnlwgt' ,'education.num', 'capital.gain', 'capital.loss', 'hours.per.week' ]]

,age,fnlwgt,education.num,capital.gain,capital.loss,hours.per.week
0,0.101430,0.324278,1.911115,13.506484,-0.217247,2.401095
1,-0.629444,-0.384543,-0.418269,-0.147970,-0.217247,-0.036170
2,0.539954,-0.762917,-0.000372,-0.147970,-0.217247,-0.036170
3,-0.483269,0.378177,0.358192,-0.147970,-0.217247,1.588673
4,1.124653,-0.388914,-3.524115,-0.147970,-0.217247,-0.036170
...,...,...,...,...,...,...
24995,0.101430,-0.557892,-0.030038,-0.147970,-0.217247,-0.036170
24996,-0.556357,-1.484272,1.134654,-0.147970,-0.217247,0.776252
24997,-0.044745,0.011541,1.134654,-0.147970,-0.217247,-0.036170
24998,-1.141055,2.192890,1.134654,-0.147970,-0.217247,-0.036170
24999,1.563177,-0.963476,-1.582961,-0.147970,-0.217247,-0.036170

### Normanisasi

In [18]:
from sklearn.preprocessing import MinMaxScaler

In [19]:
mm = MinMaxScaler()
df3 = df.copy()
df3[['fnlwgt']] = mm.fit_transform(df3[['fnlwgt']])

In [20]:
df3['fnlwgt'].describe()

count    24988.000000
mean         0.120477
std          0.071635
min          0.000000
25%          0.071794
50%          0.112694
75%          0.152653
max          1.000000
Name: fnlwgt, dtype: float64

## One Hot Encoding

In [21]:
from sklearn.preprocessing import OneHotEncoder

#### menampilkan isi dari "sex"

In [22]:
df['sex'].value_counts()

sex
Male      16710
Female     8278
Name: count, dtype: int64

In [23]:
ohe =  OneHotEncoder (sparse_output=False)
ohe_income = ohe.fit_transform(df[['sex']])

In [24]:
encoded = pd.DataFrame(ohe_income,
                       columns=['female','male'])
encoded

       female  male
0         0.0   1.0
1         1.0   0.0
2         0.0   1.0
3         0.0   1.0
4         1.0   0.0
...       ...   ...
24983     1.0   0.0
24984     1.0   0.0
24985     0.0   1.0
24986     1.0   0.0
24987     0.0   1.0

[24988 rows x 2 columns]

In [25]:
df = pd.concat([df, encoded], axis=1)
df.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income,female,male
0,40.0,Self-emp-not-inc,223881.0,Prof-school,15.000000,Married-civ-spouse,Prof-specialty,Husband,White,Male,99999.0,0.0,70.0,United-States,>50K,0.0,1.0
1,30.0,Private,149118.0,HS-grad,9.000000,Divorced,Craft-repair,Not-in-family,White,Female,0.0,0.0,40.0,United-States,<=50K,1.0,0.0
2,46.0,Private,109209.0,Some-college,10.076415,Married-civ-spouse,Adm-clerical,Husband,White,Male,0.0,0.0,40.0,United-States,>50K,0.0,1.0
3,32.0,Private,229566.0,Assoc-voc,11.000000,Married-civ-spouse,Other-service,Husband,White,Male,0.0,0.0,60.0,United-States,>50K,0.0,1.0
4,54.0,?,148657.0,Preschool,1.000000,Married-civ-spouse,?,Wife,White,Female,0.0,0.0,40.0,Mexico,<=50K,1.0,0.0

## Data Split

#### mwmbagi dataset menjadi 2 bagian traning set dan testing set dengan masing masing proprsi 70:30.

In [26]:
from sklearn.model_selection import train_test_split

#### variabel x adalah stribut selain income, variabel y berisi target yaitu atribut income

In [27]:
x = df.drop(columns='income')
y = df['income']

#### membuat kelas train_test untuk membagi datanya dengan testing 0,3.

In [30]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.3, random_state=12)

#### menampilkan hasil dari split data

In [33]:
print(x_train.shape)
print(x_test.shape)
print(y_train.shape)
print(y_test.shape)

(17500, 16)
(7500, 16)
(17500,)
(7500,)